type ConstellationData = {
  [key: string]: {
    name: string;
    description: string;
  };
};

export const jsonData: ConstellationData = {
  "aRyuu-za.glb": {
    name: "りゅう座",
    description:
      "りゅう座は、北の空に大きく横たわる伝説の動物、竜の姿を表した星座です。小さな四角形に並んだ星が竜の頭の部分で、長い胴体を大きく折り曲げながらこぐま座とおおぐま座の間にしっぽを伸ばしています。りゅう座α星トゥバンは4等星の目立たない星ですが、紀元前2790年頃は、天の北極を示す北極星として知られていました。そのため、当時はエジプトのピラミッドを建設する上で重要な働きをしていました。",
  },
  "Uo-za.glb": {
    name: "うお座",
    description:
      "うお座は、ヒモで結ばれた2匹の魚の姿をした秋の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の最後の星座でもあります。うお座は4等星以下の暗い星ばかりでできているため、なかなか見つけにくい星座です。しかし春分点(春分の日に太陽が見える方向)がうお座の中にあることため、天文学的には重要な意味を持つ星座です。",
  },
  "Tenbin-za.glb": {
    name: "てんびん座",
    description:
      "てんびん座は、重さをはかる天秤の形を表した夏の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。さそり座のアンタレスとおとめ座のスピカのほぼ中間に、「く」の字を裏返した形で並んでいます。元々古代ギリシャでは、さそり座の一部であり、てんびん座の部分をさそりの2つのつめ(はさみ)に割り当てていました。その後、ローマ時代にてんびん座として独立したと考えられています。てんびん座がさそり座の一部だった時代の名残として、α星ズベン・エル・ゲヌビは「南のつめ」、β星ズベン・エル・カマリは「北のつめ」という意味を持っています。",
  },
  "Tate-za.glb": {
    name: "たて座",
    description:
      "たて座は、十字架の描かれた盾の形をした夏の星座です。17世紀にオスマン・トルコ帝国と戦い打ち破ったポーランド国王ヤン3世ソビエスキーをたたえられて作られた、実在の人物に由来するめずらしい星座です。",
  },
  "Ohituji-za.glb": {
    name: "おひつじ座",
    description:
      "おひつじ座は、平原に佇む羊の姿を表した秋の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。ひつじの頭にあたる2等星ハマルが最も明るく、ほかの3～4等星の暗い星が「へ」の字のように並んだ形をして輝いています。おひつじ座の頭のあたりγ星メサルティムは、2つの星がぴったり寄り添った二重星であり、おひつじ座の魅力の1つとなっています。",
  },
  "Andromeda-za.glb": {
    name: "アンドロメダ座",
    description:
      "アンドロメダ座は、ギリシャ神話の古代エチオピア王女アンドロメダ姫の姿をした秋の星座です。アンドロメダ座の腰のあたりには、「アンドロメダ大銀河 M31」という、およそ230万光年離れたところにある大きな渦巻銀河があります。アンドロメダ大銀河は、私たちが住む天の川銀河から最も近いところにあり、かつ日本から見える最大の銀河です。肉眼でも雲のようにぼんやりと光って見えます。",
  },
  "Minamei-juzi-za.glb": {
    name: "みなみじゅうじ座",
    description:
      "みなみじゅうじ座は、半人半馬の姿をしたケンタウルスの伝説的な存在の姿を形作る夏の星座です。ギリシャ神話では、ケンタウロス族の一員であるケイローンが知恵と力強さを兼ね備えた存在とされています。",
  },
  "Iruka-za.glb": {
    name: "いるか座",
    description:
      "いるか座は、大海原を泳ぐイルカの姿をした夏の小さな星座です。わし座のすぐ東に小さな4つの星がトランプのダイヤの形に並んでいます。日本では、菱形に並ぶその形からひし星とも呼ばれていたそうです。またその特徴的な形から、ヨーロッパでは「ヨルの棺」、アラビアでは「ラクダ」、中国では「畑のうり」と呼ばれていました。",
  },
  "Ushikai-za.glb": {
    name: "牛飼い座",
    description:
      "うしかい座は、猟犬を従える巨人の姿をした春の星座です。うしかい座1等星α星アークトゥルスは、おおぐま座の後ろについてまわることから、ギリシャ語で「熊の番人」とうい意味を持っています。またうしかい座α星アークトゥルスは、おとめ座の1等星スピカ、しし座の2等星デネボラと合わせて「春の大三角」と呼ばれています。",
  },
  "Wasi-za.glb": {
    name: "わし座",
    description:
      "わし座は、わしの姿をした夏の星座です。天の川の中で白く輝くα星アルタイルを中心に、少し形の崩れた十字の形をしています。わし座α星アルタイルは、日本では七夕の「ひこ星」として知られ、「おりひめ星」にあたること座のα星ベガとは、天の川を挟んで対になって輝いています。また、わし座のアルタイル、こと座のベガに加えて、はくちょう座のデネブを合わせてできる三角形は「夏の大三角」と呼ばれ、夏の星座観察の主役となっています。",
  },
  "Ite-za.glb": {
    name: "いて座",
    description:
      "いて座は、ギリシャ神話に登場する半人半馬のケンタウロス族ケイローンの姿をした夏の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。いて座の腕や弓の付近には、北斗七星によく似た6つの星の並びが並んでおり、「南斗六星」と呼ばれ、いて座を見つける際の目印となっています。いて座は、天の川銀河の中心方向にあるので、M8散光星雲やM22球状星団などさまざまな星雲や星団を観察することができます。",
  },
  "Orion-za.glb": {
    name: "オリオン座",
    description:
      "オリオン座は、ギリシャ神話の狩人オリオンの姿を表した冬の星座です。オリオン座で目をひくのは、赤みを帯びた1等星ベテルギウスです。ベテルギウスは赤色超巨星と呼ばれる恒星で、もうすぐ爆発して寿命を迎えると考えられています。オリオン座もう一つの1等星リゲルは、青色超巨星と呼ばれる恒星で、太陽の50倍大きく、太陽の4万倍もの明るさがあります。",
  },
  "Kirin-za.glb": {
    name: "きりん座",
    description:
      "きりん座は、北の空に横たわるキリンの姿を表した冬の星座です。北極星の近くにある大きな星座で、日本では一年中見ることができますが、明るい星がないため、姿を想像するのは少し難しいかもしれません。",
  },
  "Pegasasu-za.glb": {
    name: "ペガサス座",
    description:
      "ペガサス座は、翼が生えた天馬の姿をした星座です。ペガサス座の胴体の4つの星は、「秋の四角形」または、「ペガサスの四角形」と呼ばれ、秋の星座を見つけるよい目印となります。",
  },
  "Yagi-za.glb": {
    name: "やぎ座",
    description:
      "頭はやぎで尾が魚というふしぎな姿をした秋の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。秋のはじめの南の空に見える逆三角形の形をした星座で、右に並んでいる二つの星が山羊の角、左はしが尾にあたります。やぎ座の角の先で光るα星アルゲティは、2つの星がぴったり寄り添った二重星で肉眼でも確認することができます。",
  },
  "Ooguma-za.glb": {
    name: "おおぐま座",
    description:
      "おおぐま座は大きな熊の姿をした春の星座です。おおぐま座の腰から尻尾にかけて、ひしゃくの形に並んだ7つの星があります。これは「北斗七星」と呼ばれおおぐま座を見つける目印となります。また北斗七星を辿っていくと北極星を見つけることができます。そのためおおぐま座は古くから方位や季節を知るために大切な星座となっています。",
  },
  "Sasori-za.glb": {
    name: "さそり座",
    description:
      "さそり座は、尾に毒針を持つさそりの姿をした夏の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。S字カーブの星の並びがさそりの形を表しています。尾近くには連続した星の並びがあり、毒針の位置にも星があります。さそり座の中央に輝くα星アンタレスは、赤色超巨星と呼ばれる、もうすぐ星の寿命が終わろうとしている星です。さそり座の心臓近くにあるため、さまざまな国で「さそりの心臓」と呼ばれています。",
  },
  "Otome-za.glb": {
    name: "おとめ座",
    description:
      "おとめ座は、手に麦の穂をもつ女神の姿を表した春の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。おとめ座のα星スピカは、女神が持つ麦の穂の先で青白く輝く1等星で、オレンジ色に輝くうしかい座の1等星アークトゥルスと合わせて「春の夫婦星」と呼ばれています。またおとめ座のα星スピカ、うしかい座のα星アークトゥルス、そいてしし座のα星レグルスを結ぶ正三角形は「春の大三角」と呼ばれています。おとめ座と髪の毛座とも境界付近には、多くの銀河が点在しており、これらの銀河のほとんどが「おとめ座銀河団」に属する銀河です。地球がある天の川銀河も、「おとめ座銀河団」の一部です。",
  },
  "hutago-za.glb": {
    name: "ふたご座",
    description:
      "ふたご座は,2人の男の子が仲良く並んだ姿を表した冬の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。おうし座の角の先に、2つの明るい星が仲良く並んだ細長い六角形の形をしており、2人の頭の部分にあたる星が、α星カストルとβ星ポルックスです。毎年12月の中旬ごろに活動が見られる「ふたご座流星群」は、カストルのあたりを中心として流れ星が四方八方に広がって飛ぶように見えます。条件が良い時には1時間に数十個の流れ星が見ることができます。",
  },
  "Mizugame-za.glb": {
    name: "みずがめ座",
    description:
      "みずがめ座は、ギリシャ神話に登場する水瓶を持つ美少年ガニメデスの姿をした秋の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。秋の夜の南の空に大きく広がっていますが、3等星以下の暗い星が多いため見つけにくい星座です。しかし2つの惑星状星雲をはじめとして、いくつもの星雲や星団があることが知られています。",
  },
  "Ookami-za.glb": {
    name: "おおかみ座",
    description:
      "おおかみ座は、ケンタウルスにヤリで突かれるオオカミの姿をした南天の星座です。主に南半球で見ることができる南天も星座ですが、6月ごろになると、南の地平線近くにその全身を見ることができるため、夏の星座とされることもあります。古代ギリシャでは、おおかみ座は独立した星座ではなく、けんたウルス座の一部としてとらえられていたようです。おおかみ座という名前が出てくるのは、13世紀のスペインの星表が最初だといわれています。",
  },
  "Yamaneko-za.glb": {
    name: "やまねこ座",
    description:
      "やまねこ座は、野生味あふれる山猫の姿を表した星座です。17世紀にポーランドの天文学者ヘベリウスによって設定されたものの、当時は「山猫または虎座」というなんとも曖昧な星座名が付けられていました。また、やまねこ座は暗い星で構成されているため、へべリウス自身が「ここに山猫の姿を見つけるのは難しい」といったほどに、わかりにくい星座です。",
  },
  "Shishi-za.glb": {
    name: "しし座",
    description:
      "しし座は、ギリシャ神話の人喰いライオンの姿を表した春の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。心臓のところに輝く1等星のレグルスと、尻尾の先にある2等星のデネボラ、この2つの星を結んで胴体を作り、レグルスの北にある星をつないで顔を作ると、立派なライオンの姿になります。獅子の胸元に輝くα星レグルスは、ラテン語で「小さな王」という意味を持ち、獅子の心臓を象徴しているとされています。アラビア語で「ししの尾」という意味を持つβ星デネボラは、うしかい座のα星アークトゥルス、おとめ座のα星スピカを結ぶ正三角形は「春の大三角」と呼ばれています。",
  },
  "Oushi-za.glb": {
    name: "おうし座",
    description:
      "おうし座は、怪人オリオンに襲いかかる牡牛の姿を表した冬の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。おうし座で最も明るい1等星アルデバランはおうしの右目に当たる星で、英語ではBull’s Eyeと呼ばれています。この星からV字型にならぶ星々が、おうしの頭から角の先までを表しています。おうしの肩先にはプレアデス星団という小さな星の集まりがあり、日本では「すばる」と呼ばれ古来から人気のある星団です。",
  },
  "Houou-za.glb": {
    name: "ほうおう座",
    description:
      "ほうおう座は、伝説の不死鳥フェニックスの姿を表した星座です。おもに南半球で見ることができる南天の星座ですが、沖縄では全体を見ることができます。赤く輝くほうおう座α星「アンカー」は、「不死鳥」という意味を持ち、炎の色をした翼を持つと伝わるフェニックスを象徴するかのような星です。",
  },
  "Kameleon-za.glb": {
    name: "カメレオン座",
    description:
      "カメレオン座は、爬虫類のカメレオンの姿をした南天の星空です。南半球で見ることのできる星座で日本からは一切見ることができません。カメレオン座の口先には、その餌となるハエ（はえ座）も設定されています。",
  },
  "Kani-za.glb": {
    name: "かに座",
    description:
      "かに座は、その名のとおりカニの姿を表した春の星座です。プトレマイオスによりまとめられた「トレミーの48星座」の1つで、誕生日星座で知られる「黄道十二星座」の1つでもあります。かに座を構成する星々には1等星や2等星のような明るい星がなく、最も明るいβ星であるアルタルフでさえも、3.5等星であり、見つけにくい星座です。かに座の甲羅の中心部には、かに座の目標となるM44プレセペ星団があり、肉眼でも雲のように淡く光る小さな星団を見ることができます。",
  },
  "Ryouken-za.glb": {
    name: "りょうけん座",
    description:
      "りょうけん座は、うしかい座の巨人が連れている2匹の猟犬の姿をした春の星座です。元々はおおぐま座の一部だった猟犬を、1678年頃にポーランドの天文学者ヘベリウスが独立させた新しい星座です。北側の犬をアステリオン、南側の犬をカーラといいおおぐま座の熊を追い立てているように見えます。",
  },
  "Ya-za.glb": {
    name: "や座",
    description:
      "や座は、弓矢の矢の形を表した夏の星座です。全天の中で3番目に小さく、あまり目立たない星座ですが、多くの文明で矢と見立てた物語が多数残っています。ギリシャ神話では勇者ヘラクレスが、鷲に向かって放った矢が星座になったとも、愛の神エロス(キューピット)の矢だとも言われています。",
  },
  "Usagi-za.glb": {
    name: "うさぎ座",
    description:
      "うさぎ座は、オリオンの足元を逃げまわるウサギの姿をした小さな冬の星座です。アラビアでは、うさぎ座の4つの星がオリオン座の南に位置することから、「オリオンの足台」や「巨人の王座」と呼んでいたそうです。",
  },
};
